In [2]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]
GradeList = zip(names,grades,bsdegrees,msdegrees,phddegrees)
df = pd.DataFrame(data=GradeList,
columns=['Names','Grades','BS degrees','MS degrees','PhD degrees'])
df

     Names  Grades  BS degrees  MS degrees  PhD degrees
0      Bob      76           1           2            0
1  Jessica      95           1           1            1
2     Mary      77           0           0            0
3     John      78           0           0            0
4      Mel      99           1           0            0

In [5]:
df.std()

Grades         11.067972
BS degrees      0.547723
MS degrees      0.894427
PhD degrees     0.447214
dtype: float64

In [6]:
df.mean()

Grades         85.0
BS degrees      0.6
MS degrees      0.6
PhD degrees     0.2
dtype: float64

In [7]:
df['Grades'].var()

122.5

In [8]:
df.count()

Names          5
Grades         5
BS degrees     5
MS degrees     5
PhD degrees    5
dtype: int64

In [9]:
df['MS degrees'].max()

2